---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralBraceRepresentation
source: html/169b9d43-15b6-daaa-c818-be980114023d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralBraceRepresentation Property

"Representation Type"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralBraceRepresentation { get; }
```